app/controllers/lists_controller.rb

  def index
    @lists = List.all.where("user_id = ?", current_user.id)
---
SELECT "lists".* FROM "lists" WHERE (user_id = NULL)

  def create
    @list = List.create(params[:list].permit(:name))
---
INSERT INTO "lists" ("name", "finished", "user_id", "type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "PleaseWork"], ["finished", "f"], ["user_id", 7], ["type_id", 1], ["created_at", "2018-02-19 08:18:15.767329"], ["updated_at", "2018-02-19 08:18:15.767329"]]

  def edit
    @list = List.find(params[:id])

    @tasks = Task.all.where("list_id = ?", @list.id)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 12]]
SELECT "tasks".* FROM "tasks" WHERE (list_id = 16)

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]