app/controllers/lists_controller.rb

  def index
    @lists = List.all
---
SELECT  "lists".* FROM "lists"  ORDER BY "lists"."id" ASC LIMIT 1