app/controllers/pages_controller.rb

SELECT "lists".* FROM "lists"
---
  def home
    @lists = List.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "user"]]
---
  def profile
    if(User.find_by_username(params[:id]))